In [30]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [31]:
Season = pd.read_csv("Input/Seasons_Stats.csv")
Player1 = pd.read_csv("Input/player_data.csv")
Player2 = pd.read_csv("Input/Players.csv")
Additional_seasons = pd.read_csv("Input/Stats 2015-2019")

In [32]:
Season.head()

,Unnamed: 0,Year,Player,Pos,Age,Tm,G,GS,MP,PER,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,0,1950.0,Curly Armstrong,G-F,31.0,FTW,63.0,NaN,NaN,NaN,...,0.705,NaN,NaN,NaN,176.0,NaN,NaN,NaN,217.0,458.0
1,1,1950.0,Cliff Barker,SG,29.0,INO,49.0,NaN,NaN,NaN,...,0.708,NaN,NaN,NaN,109.0,NaN,NaN,NaN,99.0,279.0
2,2,1950.0,Leo Barnhorst,SF,25.0,CHS,67.0,NaN,NaN,NaN,...,0.698,NaN,NaN,NaN,140.0,NaN,NaN,NaN,192.0,438.0
3,3,1950.0,Ed Bartels,F,24.0,TOT,15.0,NaN,NaN,NaN,...,0.559,NaN,NaN,NaN,20.0,NaN,NaN,NaN,29.0,63.0
4,4,1950.0,Ed Bartels,F,24.0,DNN,13.0,NaN,NaN,NaN,...,0.548,NaN,NaN,NaN,20.0,NaN,NaN,NaN,27.0,59.0

In [33]:
Player1.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

In [34]:
Player2.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [35]:
Season.drop("Unnamed: 0",axis=1,inplace=True)
Season.dropna(how="all",inplace=True)
Player1.dropna(how="all",inplace=True)
Player2.drop("Unnamed: 0",axis=1,inplace=True)
Player2.dropna(how="all",inplace=True)

In [36]:
Player = pd.merge(Player1,Player2,left_on="name",right_on="Player")

In [37]:
Player.drop("Player",axis=1,inplace=True)
Player.drop("collage",axis=1,inplace=True)
Player.drop("height_x",axis=1,inplace=True)
Player.drop("weight_x",axis=1,inplace=True)
Player.drop("birth_date",axis=1,inplace=True)

In [38]:
Player.head()

,name,year_start,year_end,position,college,height_y,weight_y,born,birth_city,birth_state
0,Alaa Abdelnaby,1991,1995,F-C,Duke University,208.0,108.0,1968.0,Cairo,Egypt
1,Zaid Abdul-Aziz,1969,1978,C-F,Iowa State University,206.0,106.0,1946.0,Brooklyn,New York
2,Mahmoud Abdul-Rauf,1991,2001,G,Louisiana State University,188.0,83.0,1942.0,Wilmington,Delaware
3,Tariq Abdul-Wahad,1998,2003,F,San Jose State University,198.0,101.0,1974.0,Maisons Alfort,France
4,Shareef Abdur-Rahim,1997,2008,F,University of California,206.0,102.0,1976.0,Marietta,Georgia

In [39]:
Player.rename(columns = {"height_y":"height","weight_y":"weight","born":"birth_year"}, inplace=True)

In [40]:
Additional_seasons = Additional_seasons.drop(columns="Unnamed: 0")
Season = Season[Additional_seasons.columns]
Season = Season.append(Additional_seasons)

In [41]:
Season.head()

,Year,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1950.0,Curly Armstrong,G-F,31.0,FTW,63.0,NaN,NaN,144.0,516.0,...,0.705,NaN,NaN,NaN,176.0,NaN,NaN,NaN,217.0,458.0
1,1950.0,Cliff Barker,SG,29.0,INO,49.0,NaN,NaN,102.0,274.0,...,0.708,NaN,NaN,NaN,109.0,NaN,NaN,NaN,99.0,279.0
2,1950.0,Leo Barnhorst,SF,25.0,CHS,67.0,NaN,NaN,174.0,499.0,...,0.698,NaN,NaN,NaN,140.0,NaN,NaN,NaN,192.0,438.0
3,1950.0,Ed Bartels,F,24.0,TOT,15.0,NaN,NaN,22.0,86.0,...,0.559,NaN,NaN,NaN,20.0,NaN,NaN,NaN,29.0,63.0
4,1950.0,Ed Bartels,F,24.0,DNN,13.0,NaN,NaN,21.0,82.0,...,0.548,NaN,NaN,NaN,20.0,NaN,NaN,NaN,27.0,59.0